package com.example.project2;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Core {

    //Класс со списаками вопросов, ответов и номерами
    public static List<String> questionsDescription = new ArrayList<String>(
            Arrays.asList(
                    "В советскую эпоху нормой стало строительство жилых домов одновременно с социальной инфраструктурой (школами, магазинами, детскими садами и спортивными площадками)  — так возводили «микрорайоны». Советские идеологи постоянно выражали энтузиазм по поводу такого типа городской застройки. Микрорайоны должны были создавать особую жилую среду, которой, по мнению советских специалистов, внутренне присущ коллективизм. Их описывали как «соединяющие в себе и семейный, и общественный характер».\n" +
                    "Однако, как показали результаты опроса 1982 года, 60 процентов жителей московских многоквартирных домов вообще не общались с соседями. Не соответствовала амбициозным государственным планам по созданию той самой «особой» жилой среды и унылая реальность неухоженных дворов и запущенных подъездов, в которых к тому же часто было очень темно (электрические лампочки воровали постоянно; по слухам, на российских барахолках можно до сих пор дёшево приобрести перегоревшие лампочки, спрос на которые объясняется исключительно тем, что их можно вкрутить <…> работающих в каком-нибудь общественном месте).\n" +
                    "В то же время стоит отметить, что ни риторика государственной идеологии, ни зубоскальство критиков не затрагивали важнейшего, по мнению самих обитателей новых квартир: проводимая при Хрущёве и Брежневе политика массовой жилой застройки успешно удовлетворяла их самые острые потребности, обеспечивая отдельным жильём невероятную по меркам прошлых десятилетий долю граждан и тем самым делая их жизнь по-настоящему современной.",
                   "1)  ВОЗВОДИТЬ. Умножить на число (матем.). Возводить число в квадрат.\n" +
                           "2)  ПО ПОВОДУ. Предлог с родит. падежом – относительно кого-чего-нибудь. Разговор по поводу новой книги.\n" +
                           "3)  ПЛАН. Взаимное расположение частей, краткая программа какого-н. изложения. П. доклада.\n" +
                           "4)  ЗАПУЩЕННЫЙ. Находящийся в упадке, запустении. Запущенное хозяйство.\n" +
                           "5)  ДОЛЯ. Участь, судьба. Тяжёлая доля выпала ему.\n" +
                           "\n" +
                           "В советскую эпоху нормой стало строительство жилых домов одновременно с социальной инфраструктурой (школами, магазинами, детскими садами и спортивными площадками)  — так возводили «микрорайоны». Советские идеологи постоянно выражали энтузиазм по поводу такого типа городской застройки. Микрорайоны должны были создавать особую жилую среду, которой, по мнению советских специалистов, внутренне присущ коллективизм. Их описывали как «соединяющие в себе и семейный, и общественный характер».\n" +
                           "Однако, как показали результаты опроса 1982 года, 60 процентов жителей московских многоквартирных домов вообще не общались с соседями. Не соответствовала амбициозным государственным планам по созданию той самой «особой» жилой среды и унылая реальность неухоженных дворов и запущенных подъездов, в которых к тому же часто было очень темно (электрические лампочки воровали постоянно; по слухам, на российских барахолках можно до сих пор дёшево приобрести перегоревшие лампочки, спрос на которые объясняется исключительно тем, что их можно вкрутить <…> работающих в каком-нибудь общественном месте).\n" +
                           "В то же время стоит отметить, что ни риторика государственной идеологии, ни зубоскальство критиков не затрагивали важнейшего, по мнению самих обитателей новых квартир: проводимая при Хрущёве и Брежневе политика массовой жилой застройки успешно удовлетворяла их самые острые потребности, обеспечивая отдельным жильём невероятную по меркам прошлых десятилетий долю граждан и тем самым делая их жизнь по-настоящему современной.",
                    "1)  Текст относится к публицистическому стилю, о чём свидетельствует одновременное использование как слов из области общественно-политической, экономической лексики (идеология, результаты опроса, с социальной инфраструктурой), так и слов разговорного характера (зубоскальство, на барахолках).\n" +
                            "2)  Точно выразить мысль автору помогают разнообразные синтаксические средства, среди которых сложноподчинённые предложения, вводные и вставные конструкции.\n" +
                            "3)  Текст относится к официально-деловому стилю, поскольку в нём отсутствуют восклицательные и вопросительные предложения, личные местоимения 1-го и 2-го лица.\n" +
                            "4)  Текст отличается яркой образностью благодаря использованию метафор (долю граждан, электрические лампочки, многоквартирных домов).\n" +
                            "5)  В тексте употребляются отглагольные существительные (например, застройка, создание), некоторые сказуемые выражаются возвратными глаголами (например, объясняется), что позволяет отнести текст к научному стилю речи.",
                    "1)  квАртал\n" +
                            "2)  окружИт\n" +
                            "3)  Оптовый\n" +
                            "4)  прозорлИва\n" +
                            "5)  донИзу",
                    "Одиночный альпинизм  — РИСКОВАННОЕ занятие.\n" +
                            "Эти развалины служат нам скорбным ВОСПОМИНАНИЕМ о событиях прошлого.\n" +
                            "Никто из нас не ожидал такого холодного и даже ВРАЖДЕБНОГО приёма.\n" +
                            "Индейцы  — общее название КОРЕННОГО населения Америки.\n" +
                            "Тут же высчитала, сколько они должны УПЛАТИТЬ.",
                    "Бóльшую половину жизни Матвей Семёнович ни о чём не беспокоился, жил на широкую ногу, много, но бесцельно путешествовал, а потом что-то резко изменилось: он стал много думать, занялся благотворительностью и даже начал писать книги.",
                    "о ПЯТИСТАХ сорока рублях\n" +
                            "копчёные ОКОРОКИ\n" +
                            "ПОЕЗЖАЙ домой\n" +
                            "МЕНЕЕ ИНТЕРЕСНО\n" +
                            "ВЫКЛАДЫВАЙ",
                    "ГРАММАТИЧЕСКИЕ ОШИБКИ\n" +
                            "А)  нарушение в построении предложения с причастным оборотом\n" +
                            "Б)  неправильное употребление падежной формы существительного с предлогом\n" +
                            "В)  ошибка в построении предложения с деепричастным оборотом\n" +
                            "Г)  нарушение в построении предложения с однородными членами\n" +
                            "Д)  нарушение связи между подлежащим и сказуемым в предложении\n" +
                            "ПРЕДЛОЖЕНИЯ\n" +
                            "1)  Автор рассказал об изменениях в книге, готовящейся им к переизданию.\n" +
                            "2)  Пони из местного цирка по вечерам катало детей.\n" +
                            "3)  Мальчишка, катавшийся на велосипеде и который с него упал, сидел рядом с мамой, прикрывая разбитое колено.\n" +
                            "4)  На небе не было ни одного облачка, но в воздухе чувствовался избыток влаги.\n" +
                            "5)  Родители требовали, чтобы я по приезду отправил им подробный отчёт и рассказал всё в мельчайших подробностях.\n" +
                            "6)  В народных представлениях власть повелевать ветрами приписывается различным божествам и мифологическим персонажам.\n" +
                            "7)  Я имею поручение как от судьи, так равно и от всех наших знакомых примирить вас с приятелем вашим.\n" +
                            "8)  Заглянув на урок, директору представилась интересная картина.\n" +
                            "9)  Беловежская пуща — наиболее крупный остаток реликтового первобытного равнинного леса, который в доисторические времена произрастал на территории Европы.\n" +
                            "Запишите в ответ цифры, расположив их в порядке, соответствующем буквам:",
                    "1)  зар..внять (яму), ог..рчиться, покл..ниться\n" +
                            "2)  к..снуться, л..скутное (одеяло), заск..чили\n" +
                            "3)  обж..гаться, зам..реть (от испуга), поч..татель (таланта)\n" +
                            "4)  пок..сившаяся (избушка), обм..кнуть (хлеб в варенье), прил..жить (усилия)\n" +
                            "5)  сб..режения, бл..стящий, (пол) з..ркальный",
                    "1)  зар..внять (яму), ог..рчиться, покл..ниться\n" +
                            "2)  к..снуться, л..скутное (одеяло), заск..чили\n" +
                            "3)  обж..гаться, зам..реть (от испуга), поч..татель (таланта)\n" +
                            "4)  пок..сившаяся (избушка), обм..кнуть (хлеб в варенье), прил..жить (усилия)\n" +
                            "5)  сб..режения, бл..стящий, (пол) з..ркальный",
                    "1)  удушл..вый, отшуч..ваться\n" +
                            "2)  разве..ться, услужл..вый\n" +
                            "3)  десят..ричный, крут..зна\n" +
                            "4)  застёг..вая, вор..вать\n" +
                            "5)  улыбч..вый, застенч..вый",
                    "1)  выдерж..т, сплет..на\n" +
                            "2)  плач..т, круж..т (метель)\n" +
                            "3)  леч..щий, подхвач..нное\n" +
                            "4)  тревож..щийся, сыгр..нный\n" +
                            "5)  жал..щий, стрел..ный",
                    "Добиться встречи с послом было вовсе (не)легко.\n" +
                            "На стене висел персидский ковер с отнюдь (не)броским орнаментом.\n" +
                            "Александру пожелали, чтобы каждый новый день его жизни был (не)похож на предыдущие.\n" +
                            "Маша сыграла на пианино очень красивую мелодию (не)известного мне композитора.\n" +
                            "Стол был (не)убран.",
                    "ТАК (ЖЕ) как и её муж, она почти (НИ)КОГДА не сидела дома.\n" +
                            "Кум, (НЕ)СМОТРЯ на всегдашнее хладнокровие, не любил уступать жене и (ОТ)ТОГО почти всегда уходил из дому с фонарями под обоими глазами.\n" +
                            "ЧТО (БЫ) никто не догадался о цели его визита, Иван за весь вечер (НИ)РАЗУ не посмотрел в сторону Анастасии Ивановны.\n" +
                            "(В)ПОСЛЕДСТВИИ наши критики поумерили пыл, а в некоторых вопросах даже пошли (НА)ПОПЯТНУЮ.\n" +
                            "Я ТО(ЖЕ) запомнил выражение его лица, которое на миг КАК(БУДТО) осветилось радостью.",
                    "Портрет стра(1)ого человека, написа(2)ый художником, обладавшим недюжи(3)ым талантом, был частью прида(4)ого ю(5)ой хозяйки дома.",
                    "1)  Ученье да труд к славе ведут.\n" +
                            "2)  Луна глядит загадочно и ласково и манит своим тусклым светом.\n" +
                            "3)  Рыцарской верностью и преданностью слову отличались Даль и Срезневский Щерба и Виноградов.\n" +
                            "4)  Шум говор толпа людей  — всё это было непривычно для Егора.\n" +
                            "5)   Оглянитесь вокруг и увидите столько нового и интересного.",
                    "Издали (1) он увидел дом (2) непохожий на другие (3) построенный (4) каким-то итальянским архитектором.",
                    "По тропке, опершись на подожок,\n" +
                            "Идет старик, сметая пыль с бурьяна.\n" +
                            "\"Прохожий!\n" +
                            "Укажи (1)дружок(2)\n" +
                            "Где тут живет (3) Есенина Татьяна?\"\n" +
                            "\"Татьяна... Гм...\n" +
                            "Да (4)вон (5) за той избой.\n" +
                            "А ты ей что?\n" +
                            "Сродни?\n" +
                            "Аль(6)может(7) сын пропащий?\"\n" +
                            "\"Да, сын.\n" +
                            "Но что(8) старик(9) с тобой?\n" +
                            "Скажи мне,\n" +
                            "Отчего ты так глядишь скорбяще?\"",
                    "Красочное зрелище представляет выход со дна водоёмов (1) скопившихся в иле газов (2) пузыри которых (3) вспыхивают на поверхности воды голубоватым пламенем.",
                    "Мальчик знал (1) что в этом подъезде служит суровый швейцар (2) и (3) что (4) если начать приставать к прохожим прямо у дверей (5) то можно отведать крепких тумаков.",
                    "1)  Щепкин познал, как он сам выражался, русскую жизнь от лакейской до дворца. 2) Внук и сын крепостного, он томился в неволе у помещика Волькенштейна. 3) Жизненный путь ставшего знаменитым артиста Щепкина продолжался семьдесят пять лет, а из этих семидесяти пяти лет только сорок два года он был свободным человеком. 4) Первые годы службы на московской сцене, о которых свидетельствовали многие современники артиста, принесли ему много разочарований и горести. 5) Но мастерство год от года росло. 6) Игра Щепкина, говорил Герцен, вся от доски до доски была проникнута теплотой, правдивостью. 7) Не зря его называли «не театралом на театре».",
                    "зАняло\n" +
                            "прибЫть\n" +
                            "сливОвый\n" +
                            "нОвостей\n" +
                            "прожИвший",
                    "ПОЕЗЖАЙ к маме\n" +
                            "свыше ЧЕТЫРЁХ ТЫСЯЧ метров\n" +
                            "несколько ЯБЛОК\n" +
                            "ОБГРЫЗАННЫЙ хлеб\n" +
                            "новых ДЖИНСОВ",
                    "ПОЕЗЖАЙ к маме\n" +
                            "свыше ЧЕТЫРЁХ ТЫСЯЧ метров\n" +
                            "несколько ЯБЛОК\n" +
                            "ОБГРЫЗАННЫЙ хлеб\n" +
                            "новых ДЖИНСОВ",
                    "ПОЕЗЖАЙ к маме\n" +
                            "свыше ЧЕТЫРЁХ ТЫСЯЧ метров\n" +
                            "несколько ЯБЛОК\n" +
                            "ОБГРЫЗАННЫЙ хлеб\n" +
                            "новых ДЖИНСОВ",
                    "1)  удва..вать, лестн..чка\n" +
                            "2)  груш..вый, нищ..та\n" +
                            "3)  обид..лся, мотылёч..к\n" +
                            "4)  локт..вой, прям..та\n" +
                            "5)  фланел..вый, заносч..вый"));
    public static List<String> answers = new ArrayList<String>(Arrays.asList(
            "вместо ИЛИ взамен",
            "24",
            "24",
            "24",
            "напоминанием",
            "часть",
            "окорока",
            "15832",
            "125",
            "34",
            "15",
            "15",
            "неизвестного",
            "несмотря оттого или оттого несмотря",
            "123",
            "35",
            "23",
            "126789",
            "2",
            "15",
            "16",
            "125",
            "обгрызенный",
            "124",
            "23",
            "123"

    ));
    public static List<String> numbers =  new ArrayList<String>(Arrays.asList(
                "1",
                "2",
                "3",
                "4",
                "5",
                "6",
                "7",
                "8",
                "9",
                "10",
                "11",
                "12",
                "13",
                "14",
                "15",
                "16",
                "17",
                "18",
                "19",
                "20",
                "21",
                "22",
                "23",
                "24",
                "25",
                "26"

        ));
        List<String> answer = new ArrayList<String>(Arrays.asList(
                "Самостоятельно подберите производный предлог, который должен стоять на месте пропуска в шестом (6) предложении текста. Запишите этот предлог.",
                "В тексте выделено пять слов. Укажите варианты ответов, в которых лексическое значение выделенного слова соответствует его значению в данном тексте. Запишите номера ответов.",
                "В тексте выделено пять слов. Укажите варианты ответов, в которых лексическое значение выделенного слова соответствует его значению в данном тексте. Запишите номера ответов.",
                "Укажите варианты ответов, в которых верно выделена буква, обозначающая ударный гласный звук. Запишите номера ответов.",
                "Укажите варианты ответов, в которых верно выделена буква, обозначающая ударный гласный звук. Запишите номера ответов.",
                "Отредактируйте предложение: исправьте лексическую ошибку, заменив неверно употреблённое слово. Запишите подобранное слово, соблюдая нормы современного русского литературного языка.",
                "В одном из выделенных ниже слов допущена ошибка в образовании формы слова. Исправьте ошибку и запишите слово правильно.",
                "Установите соответствие между грамматическими ошибками и предложениями, в которых они допущены: к каждой позиции первого столбца подберите соответствующую позицию из второго столбца.",
                "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Укажите варианты ответов, в которых в обоих словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Определите предложение, в котором оба выделенных слова пишутся СЛИТНО. Раскройте скобки и выпишите эти два слова.",
                "Определите предложение, в котором оба выделенных слова пишутся СЛИТНО. Раскройте скобки и выпишите эти два слова.",
                "Расставьте знаки препинания. Укажите предложения, в которых нужно поставить ОДНУ запятую. Запишите номера этих предложений.",
                "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
                "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
                "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
                "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
                "Найдите предложения, в которых запятые ставятся в соответствии с одним и тем же правилом пунктуации. Запишите номера этих предложений.",
                "Найдите предложения, в которых запятые ставятся в соответствии с одним и тем же правилом пунктуации. Запишите номера этих предложений.",
                "Найдите предложения, в которых запятые ставятся в соответствии с одним и тем же правилом пунктуации. Запишите номера этих предложений.",
                "Найдите предложения, в которых запятые ставятся в соответствии с одним и тем же правилом пунктуации. Запишите номера этих предложений.",
                "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
                "Укажите варианты ответов, в которых в обоих словах одного ряда пропущена одна и та же буква. Запишите номера ответов."

        ));
       public  static  List<String> questions = new ArrayList<String>(Arrays.asList(
               "Самостоятельно подберите производный предлог, который должен стоять на месте пропуска в шестом (6) предложении текста. Запишите этот предлог.",
               "В тексте выделено пять слов. Укажите варианты ответов, в которых лексическое значение выделенного слова соответствует его значению в данном тексте. Запишите номера ответов.",
               "Укажите варианты ответов, в которых даны верные характеристики фрагмента текста. Запишите номера этих ответов.",
               "Укажите варианты ответов, в которых верно выделена буква, обозначающая ударный гласный звук. Запишите номера ответов.",
               "В одном из приведённых ниже предложений НЕВЕРНО употреблено выделенное слово. Исправьте лексическую ошибку, подобрав к выделенному слову пароним. Запишите подобранное слово.",
              "В одном из приведённых ниже предложений НЕВЕРНО употреблено выделенное слово. Исправьте лексическую ошибку, подобрав к выделенному слову пароним. Запишите подобранное слово.",
               "В одном из приведённых ниже предложений НЕВЕРНО употреблено выделенное слово. Исправьте лексическую ошибку, подобрав к выделенному слову пароним. Запишите подобранное слово.",
               "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
               "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
               "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
               "Определите предложение, в котором НЕ со словом пишется СЛИТНО. Раскройте скобки и выпишите это слово.",
               "Определите предложение, в котором НЕ со словом пишется СЛИТНО. Раскройте скобки и выпишите это слово.",
               "Укажите все цифры, на месте которых пишется НН. Цифры укажите в порядке возрастания.",
               "Расставьте знаки препинания. Укажите предложения, в которых нужно поставить ОДНУ запятую. Запишите номера этих предложений.",
               "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
               "Расставьте все недостающие знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
               "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
               "Расставьте все знаки препинания: укажите цифру(-ы), на месте которой(-ых) в предложении должна(-ы) стоять запятая(-ые).",
               "Найдите предложения, в которых запятые ставятся в соответствии с одним и тем же правилом пунктуации. Запишите номера этих предложений.",
               "Укажите варианты ответов, в которых верно выделена буква, обозначающая ударный гласный звук. Запишите номера ответов.",
               "В одном из выделенных ниже слов допущена ошибка в образовании формы слова. Исправьте ошибку и запишите слово правильно.",
               "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
               "Укажите варианты ответов, в которых во всех словах одного ряда пропущена одна и та же буква. Запишите номера ответов.",
               "Укажите варианты ответов, в которых в обоих словах одного ряда пропущена одна и та же буква. Запишите номера ответов."
               ));

    }

